cases/artigo_mestrado/on-caso-1.2/_grid/P3900_d1e19_neohooke/fluid/0/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
dimensions      [ 0 2 -2 0 0 0 0 ];
internalField   uniform 0.0;
boundaryField
{
    inlet
    {
        type            uniformFixedValue;
        uniformValue    table
        (
            (0   0)
            (1   0.39)
            (2   0.78)
            (3   1.17)
            (4   1.56)
            (5   1.95)
            (6   2.34)
            (7   2.73)
            (8   3.12)
            (9   3.51)
            (10   3.9)
        );
    }
    outlet_peri      { type fixedValue; value uniform 0.0; }
    fsi_pia          { type zeroGradient; }
    fsi_dura         { type zeroGradient; }
    lid_wall_inner   { type zeroGradient; }
    lid_wall_outer   { type zeroGradient; }
}
