cases/artigo_mestrado/on-caso-1.2/_grid/P3900_d1e19_neohooke/fluid/0/pointDisplacement
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}

// on-caso-1 - pointDisplacement aciona o motion solver displacementLaplacian.
//
// IMPORTANTE: lid_wall_inner/outer compartilham vertices em z=30 com
// fsi_pia/fsi_dura. Usar fixedValue (0 0 0) nesses lid walls sobrescreve
// a displacement preCICE no anel z=30, criando descontinuidade e forcas
// espurias. Usamos zeroGradient para deixar o motion solver decidir nesses
// pontos: o ring z=30 segue fsi_pia/dura (preCICE), o ring z=30.5 e' fixo
// (outlet_peri), gradiente suave entre eles.
//
// dimensions [0 1 -1 0 0 0 0] segue tutorial s4f-3dTube (taxa de deslocamento,
// nao deslocamento absoluto - o solver displacementLaplacian integra na window).

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 0 0 0 );

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }

    outlet_peri
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }

    fsi_pia
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    fsi_dura
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    lid_wall_inner
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    lid_wall_outer
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
}
